Terraform Plan Output:
```
module.appcd_6d0d835b-04d1-4911-a468-a09a3ca69c65.data.aws_caller_identity.current: Reading...
module.appcd_6d0d835b-04d1-4911-a468-a09a3ca69c65.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.appcd_6d0d835b-04d1-4911-a468-a09a3ca69c65.aws_kms_alias.a[0] will be created
  + resource "aws_kms_alias" "a" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-goblin-mysterio"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.appcd_6d0d835b-04d1-4911-a468-a09a3ca69c65.aws_kms_key.custom_s3_kms_key[0] will be created
  + resource "aws_kms_key" "custom_s3_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Custom KMS key for s3 bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.appcd_6d0d835b-04d1-4911-a468-a09a3ca69c65.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "goblin-mysterio"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "appstack" = "Mysterio"
        }
      + tags_all                    = {
          + "appstack" = "Mysterio"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.appcd_6d0d835b-04d1-4911-a468-a09a3ca69c65.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.appcd_6d0d835b-04d1-4911-a468-a09a3ca69c65.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_6d0d835b-04d1-4911-a468-a09a3ca69c65.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/mysterio"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "appstack"  = "Mysterio"
          + "component" = "hello-kitty"
        }
      + tags_all          = {
          + "appstack"  = "Mysterio"
          + "component" = "hello-kitty"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_cloudwatch_log_group_aws_lambda_mysterio_arn  = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_mysterio_name = "/aws/lambda/mysterio"
  + aws_s3_goblin_mysterio_arn                        = (known after apply)
  + aws_s3_goblin_mysterio_bucket_name                = (known after apply)
  + aws_s3_goblin_mysterio_kms_arn                    = (known after apply)

```